package two2;

public class Main {
	public static void main(String[] args) {
		System.out.println("Hello world!");

		// Создаем тестинг
		// есть библиотеки с репозиториями для тестинга с .jar maven_repository
		// ищем search.maven.org -> ищем testng -> gradle -> копируем и вствляем в файл build.gradle
		// 18 Делаем первый тест используя фреймворк для запуска тестов TestNG.
		// Создаём пакет new -> package test НО Уменя не получилось я хч почему
		// ПОТОМУ что я писал код в обычной папке но нужно MODULE потом внутри можно открыть package
		//просто буду делать это всё здесь
		// Не я создам SquareTest.java

		// -------------------\\
		//---Cочетания клавиш---\\
		//------------------------\\

// Alt + Enter = исправление ошибок
		// Ctrl  +  пробел = вкл автодобавление

// Метод из куска кода просто берем - выбираем код и
		// Refactor > Extract и все
	}

}